ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/AUDIO_Standalone/Src/main.c
// main.c
char* kVersion = "USB audio 16/2/18";
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>

#include "stm32f7xx_hal.h"

#include "usbd_conf.h"
#include "usbd_def.h"
#include "usbd_core.h"
#include "usbd_ioreq.h"

#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_audio.h"
//}}}

//{{{  packet defines
#define CHANNELS              4
#define SAMPLE_RATE           48000
#define BYTES_PER_SAMPLE      2

#define PACKETS_PER_SECOND    1000
#define PACKETS               8
#define PACKET_SAMPLES        (SAMPLE_RATE / PACKETS_PER_SECOND)
#define PACKET_SIZE           (CHANNELS * PACKET_SAMPLES * BYTES_PER_SAMPLE)

#define SLOTS                 4
#define SLOTS_PACKET_SIZE     (SLOTS * BYTES_PER_SAMPLE * PACKET_SAMPLES)
#define SLOTS_PACKET_BUF_SIZE (PACKETS * SLOTS_PACKET_SIZE)
//}}}

//{{{  global debug vars
#define DEBUG_STRING_SIZE   40
#define DEBUG_DISPLAY_LINES 16
#define DEBUG_MAX_LINES     1000

static int gTick = 0;
static int gLayer = 1;

static uint16_t gDebugLine = 0;
static char* gDebugStr[DEBUG_MAX_LINES];
static uint32_t gDebugTicks[DEBUG_MAX_LINES];
static uint32_t gDebugColour[DEBUG_MAX_LINES];

static int gHit = 0;
static int gHitX = 0;
static int gHitY = 0;
static int gLastX = 0;
static int gLastY = 0;

static int gScroll = 0;
//}}}
//{{{  global waveform vars
// waveform
static uint16_t gPackets = 0;
static uint16_t gSample = 0;
static uint16_t gCentreX = 0;
static uint16_t gCentreY = 0;
static unsigned sumFL = 0;
static unsigned sumFR = 0;
static unsigned sumRL = 0;
static unsigned sumRR = 0;
static uint16_t gFL[240];
static uint16_t gFR[240];
static uint16_t gRL[240];
static uint16_t gRR[240];
//}}}
static int gFaster = 1;
static int writePtrOnRead = 0;
static TS_StateTypeDef gTS_State;

//{{{
static int getScrollScale() {
  return BSP_LCD_GetFont()->Height / 3;
  }
//}}}
//{{{
static int getScrollLines() {
  return gScroll / getScrollScale();
  }
//}}}
//{{{
static void setScrollValue (int scroll) {

  gScroll = scroll;

  if (scroll < 0)
    gScroll = 0;
  else if (getScrollLines() >  gDebugLine - DEBUG_DISPLAY_LINES)
    gScroll = (gDebugLine - DEBUG_DISPLAY_LINES) * getScrollScale();
  }
//}}}
//{{{
static void initLcd() {

  BSP_LCD_Init();

  BSP_LCD_LayerDefaultInit (0, LCD_FB_START_ADDRESS);
  BSP_LCD_SelectLayer(0);
  BSP_LCD_SetBackColor (LCD_COLOR_BLACK);
  BSP_LCD_SetTextColor (LCD_COLOR_WHITE);
  BSP_LCD_Clear (LCD_COLOR_BLACK);
  BSP_LCD_SetFont (&Font16);
  BSP_LCD_SetLayerVisible (0, ENABLE);
  BSP_LCD_SetTransparency (0, 255);

  BSP_LCD_LayerDefaultInit (1, LCD_FB_START_ADDRESS + (BSP_LCD_GetXSize() * BSP_LCD_GetYSize() * 4));
  BSP_LCD_SelectLayer(1);
  BSP_LCD_SetBackColor (LCD_COLOR_BLACK);
  BSP_LCD_SetTextColor (LCD_COLOR_WHITE);
  BSP_LCD_Clear (LCD_COLOR_BLACK);
  BSP_LCD_SetFont (&Font16);
  BSP_LCD_SetLayerVisible (1, ENABLE);
  BSP_LCD_SetTransparency (1, 0);

  BSP_LCD_DisplayOn();

  for (int i = 0; i < DEBUG_MAX_LINES; i++)
    gDebugStr[i] = NULL;
  }
//}}}
//{{{
static void showLcd() {

  BSP_LCD_SelectLayer (gLayer);
  BSP_LCD_Clear (LCD_COLOR_BLACK);

  uint32_t wait = 20 - (HAL_GetTick() % 20);
  HAL_Delay (wait);
  gTick = HAL_GetTick();

  char str1[40];
  sprintf (str1, "%s %s %d %d %d", kVersion, gFaster ? "fast" : "slow", writePtrOnRead, (int)gTick, (int)wait);
  BSP_LCD_SetTextColor (gFaster ? LCD_COLOR_WHITE : LCD_COLOR_YELLOW);
  BSP_LCD_DisplayStringAtLine (0, str1);

  if (!BSP_PB_GetState (BUTTON_KEY)) {
    for (int displayLine = 0; (displayLine < gDebugLine) && (displayLine < DEBUG_DISPLAY_LINES); displayLine++) {
      int debugLine = (gDebugLine <= DEBUG_DISPLAY_LINES) ?
                        displayLine : gDebugLine - DEBUG_DISPLAY_LINES + displayLine - getScrollLines();
      debugLine = debugLine % DEBUG_MAX_LINES;
      BSP_LCD_SetTextColor (LCD_COLOR_WHITE);
      char tickStr[20];
      sprintf (tickStr, "%2d.%03d", (int)gDebugTicks[debugLine] / 1000, (int)gDebugTicks[debugLine] % 1000);
      BSP_LCD_DisplayStringAtLineColumn (1+displayLine, 0, tickStr);
      BSP_LCD_SetTextColor (gDebugColour[debugLine]);
      BSP_LCD_DisplayStringAtLineColumn (1+displayLine, 7, gDebugStr[debugLine]);
      }
    }

  BSP_LCD_SetTextColor (LCD_COLOR_GREEN);
  uint16_t sample = gSample;
  for (int i = 0; i < gCentreX; i++) {
    sample = (sample + 1) % gCentreX;
    BSP_LCD_FillRect (i*2, gCentreY - gFL[sample], 2, gFL[sample]+gFR[sample]);
    }

  for (int i = 0; i < gTS_State.touchDetected; i++) {
    BSP_LCD_SetTextColor (LCD_COLOR_YELLOW);
    BSP_LCD_FillCircle (gTS_State.touchX[i], gTS_State.touchY[i], 10);
    }

  BSP_LCD_SetTransparency (gLayer, 255);
  gLayer = !gLayer;
  BSP_LCD_SetTransparency (gLayer, 0);
  }
//}}}
//{{{
static void debug (uint32_t colour, const char* format, ... ) {

  gDebugColour[gDebugLine] = colour;
  gDebugTicks[gDebugLine] = HAL_GetTick();

  va_list args;
  va_start (args, format);
  free (gDebugStr[gDebugLine]);
  gDebugStr[gDebugLine] = (char*)malloc (vsnprintf (NULL, 0, format, args) + 1);
  vsnprintf (gDebugStr[gDebugLine], DEBUG_STRING_SIZE, format, args);
  va_end (args);

  gDebugLine = (gDebugLine+1) % DEBUG_MAX_LINES;
  }
//}}}
//{{{
static void onPress (int x, int y) {
  }
//}}}
//{{{
static void onMove (int x, int y) {

  gScroll += y;
  setScrollValue (gScroll + y);
  }
//}}}
//{{{
static void onRelease (int x, int y) {
  }
//}}}
//{{{
static void touch() {

  BSP_TS_GetState (&gTS_State);

  if (gTS_State.touchDetected) {
    // pressed
    if (gHit) {
      int x = gTS_State.touchX[0];
      int y = gTS_State.touchY[0];
      onMove (x - gLastX, y - gLastY);
      gLastX = x;
      gLastY = y;
      }
    else {
      gHitX = gTS_State.touchX[0];
      gHitY = gTS_State.touchY[0];
      onPress (gHitX, gHitY);
      gLastX = gHitX;
      gLastY = gHitY;
      }
    gHit = 1;
    }
  else if (gHit) {
    // released
    onRelease (gLastX, gLastY);
    gHit = 0;
    }
  }
//}}}

USBD_HandleTypeDef gUsbDevice;
PCD_HandleTypeDef gPcdHandle;
//{{{  interrupt, system handlers
void NMI_Handler() {}
void SVC_Handler() {}
void PendSV_Handler() {}
void DebugMon_Handler() {}

void BusFault_Handler() { while (1) {} }
void HardFault_Handler() { while (1) {} }
void MemManage_Handler() { while (1) {} }
void UsageFault_Handler() { while (1) {} }

void SysTick_Handler() { HAL_IncTick(); }

extern SAI_HandleTypeDef haudio_out_sai;
void DMA2_Stream4_IRQHandler() { HAL_DMA_IRQHandler (haudio_out_sai.hdmatx); }
//}}}
//{{{  usbd pcd handler
void OTG_FS_IRQHandler() { HAL_PCD_IRQHandler (&gPcdHandle); }
void OTG_HS_IRQHandler() { HAL_PCD_IRQHandler (&gPcdHandle); }

